{"Language":"en_us","Programming Language":"C#","Original Requirements":"Write a PRD for a Windows app that helps me organize daily tasks, assign work to team members, and review the code before release.","Project Name":"task_manager","Product Goals":["Create a user-friendly interface for task management","Enable efficient assignment and tracking of team tasks","Facilitate code review before release"],"User Stories":["As a team leader, I want to be able to assign tasks to my team members","As a team member, I want to see my assigned tasks and their deadlines","As a developer, I want to submit my code for review before release","As a reviewer, I want to review the code and provide feedback"],"Competitive Analysis":["Microsoft To Do: Simple interface, lacks team task assignment feature","Asana: Comprehensive task management, but lacks code review feature","Jira: Advanced task tracking and code review, but complex interface","Trello: User-friendly interface, lacks code review feature","GitHub: Excellent for code review, lacks task management features"],"Competitive Quadrant Chart":"quadrantChart\n    title \"Task Management and Code Review Capabilities\"\n    x-axis \"Low Task Management\" --> \"High Task Management\"\n    y-axis \"Low Code Review\" --> \"High Code Review\"\n    quadrant-1 \"We should expand\"\n    quadrant-2 \"Need to promote\"\n    quadrant-3 \"Re-evaluate\"\n    quadrant-4 \"May be improved\"\n    \"Microsoft To Do\": [0.2, 0.1]\n    \"Asana\": [0.8, 0.2]\n    \"Jira\": [0.9, 0.9]\n    \"Trello\": [0.7, 0.1]\n    \"GitHub\": [0.2, 0.9]\n    \"Our Target Product\": [0.8, 0.8]","Requirement Analysis":"The product needs to have a task management system that allows users to create, assign, and track tasks. It also needs to have a code review system where developers can submit their code and reviewers can provide feedback.","Requirement Pool":[["P0","Task creation and assignment feature"],["P0","Task tracking feature"],["P0","Code submission feature"],["P0","Code review and feedback feature"],["P1","Notification system for task updates and review feedback"]],"UI Design draft":"The UI should be clean and intuitive, with a dashboard showing the list of tasks and their status. There should be a separate section for code submission and review.","Anything UNCLEAR":"The specific requirements for the code review feature need to be clarified. For example, should it support multiple programming languages, and what kind of feedback should reviewers be able to provide?"}